{
    "personalInfo": {
        "names": {
            "first": "Konstantin",
            "middle": "Simeonov",
            "last": "Simeonov"
        },
        "title": "Full-stack JavaScript developer who loves to dance",
        "photoUrl": "/public/assets/photo.jpg",
        "contacts": [
            {
                "content": "+359 885 032 502",
                "iconUrl": "/public/assets/phone-icon.png",
                "type": "phone"
            },
            {
                "content": "kon.simeonov@protonmail.com",
                "iconUrl": "/public/assets/email-icon.png",
                "type": "email"
            },
            {
                "content": "Sofia, Bulgaria",
                "iconUrl": "/public/assets/address-icon.png",
                "type": "address"
            },
            {
                "content": "https://github.com/KonstantinSimeonov",
                "iconUrl": "/public/assets/github-icon.png",
                "type": "url"
            }
        ],
        "aboutMe": "Here is the part where I tell you about myself. Here be text. Whole lotta text. I don't even remotely have the slightest idea what kind of mish-mash-potato-gibberish im going to write here. Need lengthy text to see how this will look thou. Gotta write the css for it too. Did I even mention how terrible I am at doing css? Aligning buttons gotta be the scariest thing ever :("
    },
    "workExperience": [
        {
            "from": "Dec 2015",
            "to": "Jan 2017",
            "jobTitle": "Technical Trainer",
            "location": "Telerik Academy",
            "descriptions": [
                "Helped more than 2000 students make their first web applications and dive into web development with C#, HTML, CSS and JavaScript",
                "Experienced firsthand how important keeping deadlines is, became better at taking responsibilities and honed organizational skills"
            ]
        }
    ],
    "languages": [
        {
            "languageName": "English",
            "level": "Proficient"
        },
        {
            "languageName": "German",
            "level": "Advanced"
        }
    ],
    "educations": [
        {
            "educationTitle": "Web Development",
            "location": "Telerik Academy",
            "from": "Jan 2015",
            "to": "Mar 2016",
            "certificate": "https://telerikacademy.com/Certificates/View/1980/6b7b6f44"
        },
        {
            "educationTitle": "Bachelor in Software Engineering",
            "location": "FMI, Sofia University \"St. Kliment Ohridski\"",
            "from": "Oct 2013",
            "to": "ongoing"
        }
    ],
    "projects": [
        {
            "title": "fluent-schemer",
            "description": "Small validation library in javascript for fluent and declarative validation",
            "links": [
                { "url": "https://www.npmjs.com/package/fluent-schemer", "tooltip": "npm homepage" }
            ]
        },
        {
            "title": "horsebin",
            "description": "Web platform for fast & easy paste sharing",
            "links": [
                { "url": "https://horsebin.herokuapp.com/pastes/create", "tooltip": "source code" }
            ]
        }
    ],
    "strengths": [
        {
            "name": "People person",
            "description": "Dancing, working on group projects with fellow students, teaching programming and being part of the trainers team @TelerikAcademy, made team work as natural as breathing to me.",
            "iconUrl": "/public/assets/learning-icon.png"
        },
        {
            "name": "Passionate learner",
            "description": "No matter if it comes to teaching or dancing, learning new things,  skills and concepts has always been a great experience to me.",
            "iconUrl": "/public/assets/heart-icon.png"
        }
    ],
    "skills": [
        {
            "name": "Algorithms",
            "description": "The time spent in the university and in Telerik Academy really got me interested into data structures and algorithms. I understand and can implement most basic and intermediate data structures, like <strong>arrays, lists, stacks, queues, maps, some trees, graphs and heaps</strong>. I'm familiar with <strong>sorting and searching algorithms, breadth- and depth-first search, topological sorting, rolling hash, dynammic programming</strong> problems like the knapsack problem and other.",
            "type": "tech"
        },
        {
            "name": "HTML5, CSS, JS",
            "description": "Using comfortably HTML5, CSS and JavaScript to build dynamic web front-end application is a skill that I developed during my time in Telerik Academy, first as a student, later a technical trainer, which included creating small single page applications and leading presentations, lectures and workshops about the DOM API, how to build games using HTML5 canvas and how to develop a single page application.",
            "type": "tech"
        },
        {
            "name": "NodeJS",
            "description": "NodeJS is one of the main reasons I love doing JavaScript! I've passed a course at Telerik Academy and I've been using it for many different purposes ever since - working with files, web crawling, creating RESTful APIs or web applications that do server-side rendering, doing small scripts to automate tasks. The thing I love most about Node is that it promotes simplicity and ease of development, but without forcing the developer to sacrifice code quality or performance.",
            "type": "tech"
        },
        {
            "name": "Shell scripting",
            "description": "Ever since I graduated from Telerik Academy, I've worked and developed under <strong>Fedora linux distribution</strong> on my personal laptop and I've been using <strong>bash</strong> to automate and simplify tasks ever since. I'm by no means an expert, but the increase in productivity, which bash gives me, motivates me to keep learning and practicing bash features.",
            "type": "tech"
        },
        {
            "name": "Maths",
            "description": "I graduated from high school with solid knowledge in the area of algebra, geometry and stereometry. I further developed my skills in that area in university, where I studied linear algebra(vectors, matrices, polynomials), calculus(derivatives, functions, limits, integrals) and discrete mathematics(sets, graphs, regular expressions, combinatorics).",
            "type": "tech"
        },
        {
            "name": "C#, ASP.NET",
            "description": "During the courses I've passed at Telerik Academy and later in my work as a trainer, I developed web applications using ASP.NET(MVC, Webforms and Web API) with C#. I've used C# to create RESTful web services, data service layers that decouple the data layer of an application, write unit tests and implement dependency inversion and dependency injection in back-end web applications.",
            "type": "tech"
        },
        {
            "name": "MongoDB",
            "description": "",
            "code": "db.skills.find({\n    $and: {\n        name: { $regex: /^mongos?db$/i },\n        level: { $gt: 'basic', $lte: 'intermediate' },\n        acquiredBy: {\n            $in: [\n                'studying in Telerik Academy',\n                'working on my own projects',\n                'preparing to present on the topic'\n            ]\n        }\n    }\n});"
,
            "type": "tech"
        },
        {
            "name": "Communication",
            "description": "My work as a technical trainer required cooperating and communicating with a wide range of different people - students, colleagues, managers, children and parents - this helped me become a better listener, explain and express my ideas better, more clear and concise. My contacts with parents and students also taught me how to reduce the tension in a conversation, how to look for and address the concerns of other and how to give constructive feedback without offending others.",
            "type": "soft"
        },
        {
            "name": "Organization",
            "description": "A part of my job @ Telerik Academy was to organize exams, lectures and other events. To manage those tasks successfully, I had to manage not only my time, but other people's time as well, as well as set deadlines, synchronize and oversee tasks, approach and negotiate with different people at different positions. All of that developed and honed my skills at organizing events, planning and managing different tasks and processes.",
            "type": "soft"
        },
        {
            "name": "Git",
            "description": "I started using Git since day one of doing programming - many of the materials I learned from and all the projects I contributed to were either hosted on GitHub, BitBucket or GitLab, which had me using git while studying and working. This in turn helped me understand the concept of distributed source control and get comfortable with branches, merging, committing, pulling, checking out git repositories at different commits, rewriting commits, looking at diffs and other great git features.",
            "type": "tech"
        },
        {
            "name": "Creativity",
            "description": "Creating exam and homework tasks, thinking of clear and concise ways of explaining programming concepts, creating demos, writing code live during presentations and working around legacy systems were a huge part of my tasks as a technical trainer - all of those tasks required good problem solving skills, creativity, ability to lay out plans, while also keeping in mind constraints and problems. Such tasks helped me elevate those skills to a whole new level during my time in Telerik Academy.",
            "type": "soft"
        },
        {
            "name": "Object-oriented programming",
            "description": "In the course of studying and working with C#, ASP.NET and JavaScript I often had contact with different object-oriented patterns and practices, which in turn made me familiar with using object-oriented techniques that help developers to write reusable, clear, concise and maintainable code. While I don't always prefer the object-oriented approach as opposed to other techniques, such as functional or data-oriented approach, I certainly enjoy using it when the situation is appropriate - polymorphism, abstraction and encapsulation make building intuitive, reusable and decoupled components of a software system much easier.",
            "type": "tech"
        },
        {
            "name": "Dancing",
            "description": "Starting from 9-th grade, I went to dancing courses for 6 years - there I danced waltz, tango, cha-cha, samba, rumba, jive and other dances. Together with programming, dancing is one of the things that I am most passionate about :)",
            "type": "soft"
        }
    ]
}